using System;

namespace R7.Text
{
    [Obsolete]
    public class RuFileTranslitTable: TranslitTableBase
    {
        private static readonly string [,] ruFileTranslitTable ={
            // apply some filename rules
            {@"[^0-9^a-z^а-я^A-Z^А-Я^\-^ё^Ё]", "_"},
            {@"_+", "_"},
            {@"\-+", "-"},
            {@"\A[_\-]+", ""},
            {@"[_\-]+\z", ""},
            {@"([_\-])[_\-]+", "$1"},
            // custom rules
            {@"\bх", "kh" },
            {@"\bХ", "Kh" },
            {@"\Bый", "y"},
            {"ье", "iye" },
            {"ья", "iya" },
            {"ью", "iyu" },
            // main rules
            {"а", "a"},
            {"б", "b"},
            {"в", "v"},
            {"г", "g"},
            {"д", "d"},
            {"е", "e"},
            {"ё", "yo"},
            {"ж", "zh"},
            {"з", "z"},
            {"и", "i"},
            {"й", "y"},
            {"к", "k"},
            {"л", "l"},
            {"м", "m"},
            {"н", "n"},
            {"о", "o"},
            {"п", "p"},
            {"р", "r"},
            {"с", "s"},
            {"т", "t"},
            {"у", "u"},
            {"ф", "f"},
            {"х", "h"},
            {"ц", "c"},
            {"ч", "ch"},
            {"ш", "sh"},
            {"щ", "sch"},
            {"ъ", ""},
            {"ы", "y"},
            {"ь", ""},
            {"э", "e"},
            {"ю", "yu"},
            {"я", "ya"},
            {"А", "A"},
            {"Б", "B"},
            {"В", "V"},
            {"Г", "G"},
            {"Д", "D"},
            {"Е", "E"},
            {"Ё", "YO"},
            {"Ж", "Zh"},
            {"З", "Z"},
            {"И", "I"},
            {"Й", "Y"},
            {"К", "K"},
            {"Л", "L"},
            {"М", "M"},
            {"Н", "N"},
            {"О", "O"},
            {"П", "P"},
            {"Р", "R"},
            {"С", "S"},
            {"Т", "T"},
            {"У", "U"},
            {"Ф", "F"},
            {"Х", "H"},
            {"Ц", "C"},
            {"Ч", "Ch"},
            {"Ш", "Sh"},
            {"Щ", "Sch"},
            {"Ъ", ""},
            {"Ы", "Y"},
            {"Ь", ""},
            {"Э", "E"},
            {"Ю", "YU"},
            {"Я", "YA"}
        };

        private RuFileTranslitTable () : base (ruFileTranslitTable)
        {
        }
    }
}

